ils.hs     capture-006  endgame-004  loadsave-004 moves-005
Whole.hs     capture-007  endgame-005  loadsave-005 moves-006
capture-001  complete-001 interact-001 loadsave-006 moves-007
capture-002  complete-002 interact-002 moves-001    moves-008
capture-003  endgame-001  loadsave-001 moves-002    special-001
Jeremys-MacBook:test jsinger$ cd ..
Jeremys-MacBook:stubb jsinger$ ls
LICENSE                  dist                     stack.yaml
README.md                main                     test
Setup.hs                 protect-the-lambda.cabal tests.txt
cabal.sandbox.config     src
Jeremys-MacBook:stubb jsinger$ cabal run
Preprocessing library protect-the-lambda-0.1.0.0...
Preprocessing executable 'protect-the-lambda' for
protect-the-lambda-0.1.0.0...
Running protect-the-lambda...
tafl> :start
Starting Game.
9 |   OOO   
8 |    O    
7 |    G    
6 |O   G   O
5 |OOGGλGGOO
4 |O   G   O
3 |    G    
2 |    O    
1 |   OOO   
   ---------
   abcdefghi
tafl> :move d1 d3
moving from d1 to d3
9 |   OOO   
8 |    O    
7 |    G    
6 |O   G   O
5 |OOGGλGGOO
4 |O   G   O
3 |   OG    
2 |    O    
1 |    OO   
   ---------
   abcdefghi
tafl> :move d5 c5
moving from d5 to c5
invalid move : please retry...
tafl> :move d5 d4
moving from d5 to d4
9 |   OOO   
8 |    O    
7 |    G    
6 |O   G   O
5 |OOG λGGOO
4 |O  GG   O
3 |   OG    
2 |    O    
1 |    OO   
   ---------
   abcdefghi
tafl> :move f1 f3
moving from f1 to f3
9 |   OOO   
8 |    O    
7 |    G    
6 |O   G   O
5 |OOG λGGOO
4 |O  GG   O
3 |   O O   
2 |    O    
1 |    O    
   ---------
   abcdefghi
tafl> :move g5 g4
moving from g5 to g4
9 |   OOO   
8 |    O    
7 |    G    
6 |O   G   O
5 |OOG λG OO
4 |O  GG G O
3 |   O O   
2 |    O    
1 |    O    
   ---------
   abcdefghi
tafl> :move f3 f4
moving from f3 to f4
9 |   OOO   
8 |    O    
7 |    G    
6 |O   G   O
5 |OOG λG OO
4 |O  GGOG O
3 |   O     
2 |    O    
1 |    O    
   ---------
   abcdefghi
tafl> :move e7 d7
moving from e7 to d7
9 |   OOO   
8 |    O    
7 |   G     
6 |O   G   O
5 |OOG λG OO
4 |O  GGOG O
3 |   O     
2 |    O    
1 |    O    
   ---------
   abcdefghi
tafl> :move i4 h4
moving from i4 to h4
9 |   OOO   
8 |    O    
7 |   G     
6 |O   G   O
5 |OOG λG OO
4 |O  GGO O 
3 |   O     
2 |    O    
1 |    O    
   ---------
   abcdefghi
tafl> :move c5 c3
moving from c5 to c3
9 |   OOO   
8 |    O    
7 |   G     
6 |O   G   O
5 |OO  λG OO
4 |O  GGO O 
3 |  GO     
2 |    O    
1 |    O    
   ---------
   abcdefghi
tafl> :move b5 b3
moving from b5 to b3
9 |   OOO   
8 |    O    
7 |   G     
6 |O   G   O
5 |O   λG OO
4 |O  GGO O 
3 | O O     
2 |    O    
1 |    O    
   ---------
   abcdefghi
tafl> :move e5 d5
moving from e5 to d5
9 |   OOO   
8 |    O    
7 |   G     
6 |O   G   O
5 |O  λXG OO
4 |O  GGO O 
3 | O O     
2 |    O    
1 |    O    
   ---------
   abcdefghi
tafl> :move a5 c5
moving from a5 to c5
9 |   OOO   
8 |    O    
7 |   G     
6 |O   G   O
5 |  OλXG OO
4 |O  GGO O 
3 | O O     
2 |    O    
1 |    O    
   ---------
   abcdefghi
tafl> :move d7 d6
moving from d7 to d6
9 |   OOO   
8 |    O    
7 |         
6 |O  GG   O
5 |  OλXG OO
4 |O  GGO O 
3 | O O     
2 |    O    
1 |    O    
   ---------
   abcdefghi
tafl> :move f9 f6
moving from f9 to f6
9 |   OO    
8 |    O    
7 |         
6 |O  GGO  O
5 |  OλX  OO
4 |O  GGO O 
3 | O O     
2 |    O    
1 |    O    
   ---------
   abcdefghi
tafl> :move d6 b6
moving from d6 to b6
9 |   OO    
8 |    O    
7 |         
6 |OG  GO  O
5 |  OλX  OO
4 |O  GGO O 
3 | O O     
2 |    O    
1 |    O    
   ---------
   abcdefghi
tafl> :move d9 d6
moving from d9 to d6
9 |    O    
8 |    O    
7 |         
6 |OG O O  O
5 |  OλX  OO
4 |O  GGO O 
3 | O O     
2 |    O    
1 |    O    
   ---------
   abcdefghi
tafl> :move b6 b5
moving from b6 to b5
9 |    O    
8 |    O    
7 |         
6 |O  O O  O
5 | G λX  OO
4 |O  GGO O 
3 | O O     
2 |    O    
1 |    O    
   ---------
   abcdefghi
tafl> :move e2 e4
moving from e2 to e4
invalid move : please retry...
tafl> :move e2 e3
moving from e2 to e3
9 |    O    
8 |    O    
7 |         
6 |O  O O  O
5 | G λX  OO
4 |O  G O O 
3 | O OO    
2 |         
1 |    O    
   ---------
   abcdefghi
tafl> :mive b5 a5
The entered command was not recognised
tafl> :move b5 a5
moving from b5 to a5
9 |    O    
8 |    O    
7 |         
6 |O  O O  O
5 |G  λX  OO
4 |O  G O O 
3 | O OO    
2 |         
1 |    O    
   ---------
   abcdefghi
tafl> :move a4 c4
moving from a4 to c4
9 |    O    
8 |    O    
7 |         
6 |O  O O  O
5 |G  λX  OO
4 |  OG O O 
3 | O OO    
2 |         
1 |    O    
   ---------
   abcdefghi
tafl> :move a5 a4
moving from a5 to a4
9 |    O    
8 |    O    
7 |         
6 |O  O O  O
5 |   λX  OO
4 |G OG O O 
3 | O OO    
2 |         
1 |    O    
   ---------
   abcdefghi
tafl> :move e3 e4 
moving from e3 to e4
9 |    O    
8 |    O    
7 |         
6 |O  O O  O
5 |   λX  OO
4 |G O OO O 
3 | O O     
2 |         
1 |    O    
   ---------
   abcdefghi
Lambdas Win
tafl>  

